13/data/attachments/a44ac6dad1cb142b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bcde9c55-436a-4e41-8d8d-46f647aec26f</nif:username>
            <nif:friendToBeAdded>Curtis_eye_Friend_72218_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>